import './Element3.css'


function Element3 (){
    function jsxCode1(){
        return(
            <h3>True jsxCode1</h3>
        )
    }
    function jsxCode2(){
        return(
            <h3>False jsxCode2</h3>
        )
    }

    let bol = false

    const fruits = [
        "яблуко", "банан", "апельсин", "груша", "ківі", "ананас", "виноград", "персик", "слива", "манго",
        "гранат", "папая", "лимон", "лайм", "кавун", "диня", "мандарин", "абрикос", "черешня", "полуниця",
        "малина", "чорниця", "ожина", "фейхоа", "кавуни", "фінік", "кокос", "авокадо", "гуава", "личі",
        "дрюґа", "тамаринд", "клементин", "хурма", "пассіфлора", "рожевий грейпфрут", "білий грейпфрут", "карака", "курага", "саподила",
        "маракуйя", "яблуко нянька", "кабачок", "жожоба", "тамарилло", "сапота", "какаду", "джекфрут", "марула", "сапоте",
        "ківі золотий", "банан червоний", "лимон зелений", "капіба", "дуріан", "салак", "лонган", "чері", "ягода асаї", "фізаліс",
        "какао", "брамблберрі", "таро", "чорний виноград", "абрикос дикий", "ямайський яблучко", "африканський манго", "кавун жовтий", "кедровий горіх", "фінік мексиканський",
        "грейпфрут рожевий", "цитрон", "пальмовий горіх", "манго індійське", "черешня кисла", "лайм перуанський", "банан кавендіш", "папайя зелена", "кокос зелений", "ананас королівський",
        "фундук", "мигдаль", "волоський горіх", "фісташка", "каші", "амла", "карамбола", "баклажан", "огірок", "перець болгарський",
        "томат", "гарбуз", "морква", "буряк", "редька", "капуста", "шпинат", "салат", "руккола", "цибуля",
        "часник", "імбир", "пастернак", "селера", "петрушка", "кріп", "базилік", "м’ята", "коріандр", "розмарин",
        "тим’ян", "лаванда", "орегано", "шавлія", "чебрець", "кмин", "аніс", "фенхель", "гірчиця", "хрін",
        "ріпа", "сочевиця", "горох", "квасоля", "нут", "кукурудза", "рис", "пшениця", "ячмінь", "овес",
        "просо", "гречка", "амарант", "кіноа", "буряк столовий", "спаржа", "артишок", "цукіні", "патисон", "брюссельська капуста",
        "кольрабі", "редис", "батат", "топінамбур", "цвітна капуста", "броколі", "капуста кольорова", "руккола дика", "салат латук", "айсберг",
        "радичіо", "ендивій", "фенугрік", "рожевий перець", "чорний перець", "кайенський перець", "чілі", "перець халапеньо", "перець табаско", "перець серрано",
        "кориця", "кардамон", "куркума", "мускатний горіх", "гвоздика", "лавровий лист", "шалфей", "мигдаль солодкий", "горіх кеш’ю", "горіх макадамія",
        "фісташки", "соя", "горох зелений", "морська капуста", "чорниця лісова", "жовта чорниця", "сироїжка", "лисички", "білі гриби", "підберезник",
        "печериці", "опеньки", "маслюки", "рядовки", "мухомори", "лисички жовті", "боровики", "трутовики", "сморчки", "строчок",
        "ведмедик медовий", "кукурудза солодка", "горіх волоський", "шишка ялина", "шишка сосна", "оливки", "кавуни", "дині", "папайя жовта", "гуава зелена"
      ];

      const fruitsObj = {
        apple: "яблуко",
        banana: "банан",
        orange: "апельсин",
        pear: "груша",
        kiwi: "ківі",
        pineapple: "ананас",
        grape: "виноград",
        peach: "персик",
        plum: "слива",
        mango: "манго",
        pomegranate: "гранат",
        papaya: "папая",
        lemon: "лимон",
        lime: "лайм",
        watermelon: "кавун",
        melon: "диня",
        mandarin: "мандарин",
        apricot: "абрикос",
        cherry: "черешня",
        strawberry: "полуниця",
        raspberry: "малина",
        blueberry: "чорниця",
        blackberry: "ожина",
        feijoa: "фейхоа",
        date: "фінік",
        coconut: "кокос",
        avocado: "авокадо",
        guava: "гуава",
        lychee: "личі",
        tamarind: "тамаринд",
        clementine: "клементин",
        persimmon: "хурма",
        passion_fruit: "маракуйя",
        grapefruit: "грейпфрут",
        dragon_fruit: "драконовий фрукт",
        sapodilla: "саподила",
        jackfruit: "джекфрут",
        marula: "марула",
        starfruit: "карамбола",
        physalis: "фізаліс",
        salak: "салак",
        longan: "лонган",
        carambola: "карамбола",
        durian: "дуріан",
        pitaya: "пітахайя",
        rambutan: "рамбутан",
        acerola: "ацерола",
        jabuticaba: "жабутікаба",
        langsat: "лангсат",
        ackee: "акі",
        mamoncillo: "мамонцілло",
        bignay: "бігнай",
        rose_apple: "рожеве яблуко",
        sugar_apple: "цукрове яблуко",
        santol: "сантол",
        snake_fruit: "зміїний фрукт",
        breadfruit: "хлібне дерево",
        lucuma: "лукума",
        medlar: "мушмула",
        mangosteen: "мангостан",
        soursop: "гуанабана",
        bael: "бел",
        horned_melon: "рігата диня",
        miracle_fruit: "чудо фрукт",
        yuzu: "юдзу",
        nance: "нанс",
        aronia: "аронія",
        sea_buckthorn: "обліпиха",
        jujube: "журупа",
        indian_fig: "індійська фіга",
        tamarillo: "тамарилло",
        che: "че",
        kei_apple: "кей яблуко",
        monkey_orange: "мавпячий апельсин",
        velvet_apple: "оксамитове яблуко",
        wax_apple: "воскове яблуко",
        cactus_pear: "кактусова груша",
        black_currant: "чорна смородина",
        red_currant: "червона смородина",
        white_currant: "біла смородина",
        cranberry: "журавлина",
        cloudberry: "морозниця",
        boysenberry: "бойзенова ягода",
        mulberry: "тутовник",
        elderberry: "бузина",
        huckleberry: "голубика",
        gooseberry: "аґрус",
        chokeberry: "горобина чорноплідна",
        bilberry: "борівка",
        loquat: "неспелий мушмула",
        cornelian_cherry: "кизил",
        barbados_cherry: "барбадоська вишня",
        japanese_plum: "японська слива",
        juneberry: "ірга",
        pawpaw: "паупау",
        canistel: "каністел",
        black_sapote: "чорний сапоте",
        white_sapote: "білий сапоте",
        mabolo: "маболо",
        ambarella: "амбара",
        tamarillo_red: "червоний тамарилло",
        tamarillo_yellow: "жовтий тамарилло",
        finger_lime: "лайм-палець",
        bush_tomato: "кущовий томат",
        desert_lime: "пустельний лайм",
        kurrajong: "кураджонг",
        muntries: "мунтрі",
        davidson_plum: "слива Девідсона",
        midgen_berry: "міджен беррі",
        quandong: "квандонг",
        lemon_myrtle: "лимонний мирт",
        anise_myrtle: "анісовий мирт",
        mountain_pepper: "гірський перець",
        boab: "боаб",
        tamarind_plum: "слива тамаринду",
        chupa_chupa: "чупа-чупа",
        ice_cream_bean: "морозивна квасоля",
        peanut_butter_fruit: "фрукт арахісового масла",
        okari_nut: "горіх окарі",
        pili_nut: "горіх пілі",
        monkey_bread: "мавпячий хліб",
        monstera_deliciosa: "монстера деліціоза",
        red_banana: "червоний банан",
        wild_mango: "дикий манго",
        golden_berry: "золота ягода",
        garden_huckleberry: "садова голубика",
        desert_fig: "пустельна фіга",
        bush_cherry: "кущова вишня",
        gooseberry_tree: "дерево аґрусу",
        sorrel_fruit: "кислиця",
        guinep: "ґвінеп",
        grumichama: "грумічама",
        cherry_moya: "черімойя",
        lucerne: "люцерна",
        ber: "бер",
        hackberry: "гакберрі",
        water_apple: "водяне яблуко",
        yellow_plum: "жовта слива",
        white_mulberry: "біла шовковиця",
        inkberry: "чорнильна ягода",
        desert_banana: "пустельний банан",
        jackalberry: "шакаловий фрукт",
        false_mastic: "фальшивий мастик",
        sapote: "сапоте",
        banana_passionfruit: "бананова маракуйя",
        cempedak: "чемпедак",
        pulasan: "пуласан",
        ilama: "ілама",
        abiu: "абіу",
        bacupari: "бакуфарі",
        velour_fruit: "велюровий фрукт",
        candle_nut: "свічковий горіх",
        fig: "інжир",
        rose_hip: "плоди шипшини",
        hawthorn: "глід",
        medjool_date: "меджул фінік",
        saskatoon_berry: "саскатунська ягода",
        west_indian_cherry: "західноіндійська вишня",
        miracle_berry: "чудо-ягода",
        blue_java_banana: "блакитний банан",
        baobab_fruit: "фрукт баобаба",
        desert_lime_berry: "ягода пустельного лайму",
        lemon_asp: "лимон аспід",
        wild_pear: "дика груша",
        green_orange: "зелений апельсин",
        rose_guava: "рожеве ґуава",
        strawberry_guava: "полуничне ґуава",
        pineapple_guava: "ананасове ґуава",
        chocolate_pudding_fruit: "шоколадний фрукт",
        rainforest_lime: "дощовий лайм",
        jelly_palm_fruit: "фрукт желейної пальми",
        yellow_dragonfruit: "жовтий драконовий фрукт"
      };

      


    return(
        <>
        <h1 className='testStyle'>Element3</h1>
        {'test'.toUpperCase() }

        <ol>
            {fruits.map((fruit, index) => (
                <li key={index}>{fruit}</li>
            ))}
        </ol>
        <ol>
            {Object.keys(fruitsObj).map((el, index) => (
                <li key={index}>{el}:{fruitsObj[el]}</li>
            ))}
        </ol>

        {bol ? jsxCode1(): jsxCode2()}

        <br />
        </>
        
    )
}

export default Element3
